###############################################################################
# Created by write_sdc
###############################################################################
current_design pcInc
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 
set_clock_uncertainty 0.2500 clk
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[0]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[10]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[11]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[12]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[13]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[14]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[15]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[16]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[17]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[18]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[19]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[1]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[20]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[21]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[22]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[23]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[24]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[25]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[26]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[27]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[28]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[29]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[2]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[30]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[31]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[3]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[4]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[5]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[6]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[7]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[8]}]
set_input_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {pcInput[9]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[0]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[10]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[11]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[12]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[13]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[14]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[15]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[16]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[17]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[18]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[19]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[1]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[20]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[21]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[22]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[23]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[24]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[25]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[26]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[27]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[28]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[29]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[2]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[30]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[31]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[3]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[4]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[5]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[6]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[7]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[8]}]
set_output_delay 5.0000 -clock [get_clocks {clk}] -add_delay [get_ports {res[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {res[31]}]
set_load -pin_load 0.0334 [get_ports {res[30]}]
set_load -pin_load 0.0334 [get_ports {res[29]}]
set_load -pin_load 0.0334 [get_ports {res[28]}]
set_load -pin_load 0.0334 [get_ports {res[27]}]
set_load -pin_load 0.0334 [get_ports {res[26]}]
set_load -pin_load 0.0334 [get_ports {res[25]}]
set_load -pin_load 0.0334 [get_ports {res[24]}]
set_load -pin_load 0.0334 [get_ports {res[23]}]
set_load -pin_load 0.0334 [get_ports {res[22]}]
set_load -pin_load 0.0334 [get_ports {res[21]}]
set_load -pin_load 0.0334 [get_ports {res[20]}]
set_load -pin_load 0.0334 [get_ports {res[19]}]
set_load -pin_load 0.0334 [get_ports {res[18]}]
set_load -pin_load 0.0334 [get_ports {res[17]}]
set_load -pin_load 0.0334 [get_ports {res[16]}]
set_load -pin_load 0.0334 [get_ports {res[15]}]
set_load -pin_load 0.0334 [get_ports {res[14]}]
set_load -pin_load 0.0334 [get_ports {res[13]}]
set_load -pin_load 0.0334 [get_ports {res[12]}]
set_load -pin_load 0.0334 [get_ports {res[11]}]
set_load -pin_load 0.0334 [get_ports {res[10]}]
set_load -pin_load 0.0334 [get_ports {res[9]}]
set_load -pin_load 0.0334 [get_ports {res[8]}]
set_load -pin_load 0.0334 [get_ports {res[7]}]
set_load -pin_load 0.0334 [get_ports {res[6]}]
set_load -pin_load 0.0334 [get_ports {res[5]}]
set_load -pin_load 0.0334 [get_ports {res[4]}]
set_load -pin_load 0.0334 [get_ports {res[3]}]
set_load -pin_load 0.0334 [get_ports {res[2]}]
set_load -pin_load 0.0334 [get_ports {res[1]}]
set_load -pin_load 0.0334 [get_ports {res[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {pcInput[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
